src/main/resources/xml/accommodationFulfillmentServicePort/retrievePackageExceptions/retrievePackageExceptions.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:retrievePackageExceptions>
         <request>
            <!--Optional:-->
            <guestFirstName>?</guestFirstName>
            <!--Optional:-->
            <guestLastName>?</guestLastName>
            <!--Optional:-->
            <roomTypeCode>?</roomTypeCode>
            <!--Optional:-->
            <facilityId>?</facilityId>
            <!--Optional:-->
            <packageCode>?</packageCode>
            <!--Optional:-->
            <arrivalDate>?</arrivalDate>
            <!--Optional:-->
            <packageExceptionType>?</packageExceptionType>
            <!--Optional:-->
            <packageExceptionStatus>?</packageExceptionStatus>
            <!--Optional:-->
            <groupCode>?</groupCode>
            <!--Optional:-->
            <groupName>?</groupName>
         </request>
         <pagination>
            <!--Optional:-->
            <pageNumber>?</pageNumber>
            <!--Optional:-->
            <maxResultsPerPage>?</maxResultsPerPage>
         </pagination>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:retrievePackageExceptions>
   </soapenv:Body>
</soapenv:Envelope>
